# Automatically generated by Amaranth 0.5.4. Do not edit.
create_project -force -name top -part xc7z010clg400-1
add_files top.v
read_xdc top.xdc
# (script_after_read placeholder)
synth_design -top top 
foreach cell [get_cells -quiet -hier -filter {amaranth.vivado.false_path == "TRUE"}] {
    set_false_path -to $cell
}
foreach pin [get_pins -of \
                 [get_cells -quiet -hier -filter {amaranth.vivado.false_path_pre == "TRUE"}] \
                 -filter {REF_PIN_NAME == PRE}] {
    set_false_path -to $pin
}
foreach cell [get_cells -quiet -hier -filter {amaranth.vivado.max_delay != ""}] {
    set clock [get_clocks -of_objects \
        [all_fanin -flat -startpoints_only [get_pin $cell/D]]]
    if {[llength $clock] != 0} {
        set_max_delay -datapath_only -from $clock \
            -to [get_cells $cell] [get_property amaranth.vivado.max_delay $cell]
    }
}
foreach cell [get_cells -quiet -hier -filter {amaranth.vivado.max_delay_pre != ""}] {
    set_max_delay \
        -to [get_pins -of [get_cells $cell] -filter {REF_PIN_NAME == PRE}] \
        [get_property amaranth.vivado.max_delay_pre $cell]
}
# (script_after_synth placeholder)
report_timing_summary -file top_timing_synth.rpt
report_utilization -hierarchical -file top_utilization_hierarchical_synth.rpt
report_utilization -file top_utilization_synth.rpt
opt_design
place_design
# (script_after_place placeholder)
report_utilization -hierarchical -file top_utilization_hierarchical_place.rpt
report_utilization -file top_utilization_place.rpt
report_io -file top_io.rpt
report_control_sets -verbose -file top_control_sets.rpt
report_clock_utilization -file top_clock_utilization.rpt
route_design
# (script_after_route placeholder)
phys_opt_design
report_timing_summary -no_header -no_detailed_paths
write_checkpoint -force top_route.dcp
report_route_status -file top_route_status.rpt
report_drc -file top_drc.rpt
report_methodology -file top_methodology.rpt
report_timing_summary -datasheet -max_paths 10 -file top_timing.rpt
report_power -file top_power.rpt
# (script_before_bitstream placeholder)
write_bitstream -force -bin_file top.bit
# (script_after_bitstream placeholder)
quit